In [1]:
import numpy as np 
import pandas as pd

In [3]:
data = {"name": pd.Series(["aman","raghav","raju"]),
       "age": pd.Series([12,23,34]),
       "Hobby": pd.Series(["Cricket", "Football","Hockey"])}
print(data)

{'name': 0      aman
1    raghav
2      raju
dtype: object, 'age': 0    12
1    23
2    34
dtype: int64, 'Hobby': 0     Cricket
1    Football
2      Hockey
dtype: object}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

     name  age     Hobby
0    aman   12   Cricket
1  raghav   23  Football
2    raju   34    Hockey

In [6]:
df.T

             0         1       2
name      aman    raghav    raju
age         12        23      34
Hobby  Cricket  Football  Hockey

In [7]:
df.ndim

2

In [8]:
df.shape

(3, 3)

In [9]:
df.size

9

In [10]:
df.dtypes

name     object
age       int64
Hobby    object
dtype: object

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   Hobby   3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [12]:
df

     name  age     Hobby
0    aman   12   Cricket
1  raghav   23  Football
2    raju   34    Hockey

In [17]:
df1 = df[["Hobby","age"]]
df1.ndim

2

In [18]:
df1

      Hobby  age
0   Cricket   12
1  Football   23
2    Hockey   34

In [19]:
df

     name  age     Hobby
0    aman   12   Cricket
1  raghav   23  Football
2    raju   34    Hockey

In [25]:
df[(df["age"] >= 18) & (df["Hobby"] == "Football")]

     name  age     Hobby
1  raghav   23  Football

In [29]:
zero = np.zeros((4,3))
zero

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [35]:
rand_num = np.random.rand(5)
rand_num

array([0.76373075, 0.5060171 , 0.50074305, 0.2548898 , 0.54396341])